request2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://localhost:7000/universities">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getAllUniversitiesRequest/>
    </soapenv:Body>
</soapenv:Envelope>